---
kind: method
id: M:Autodesk.Revit.DB.SolidGeometryOptions.Dispose
source: html/46688fe1-222f-bd75-24df-53cb04cc7efe.htm
---
# Autodesk.Revit.DB.SolidGeometryOptions.Dispose Method

Releases all resources used by the SolidGeometryOptions

## Syntax (C#)
```csharp
public void Dispose()
```